# OfVector Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform1D..::..OfVector Method
Transform1D Class See Also
---
Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double OfVector(
	double vector
)
```

Visual Basic
---
```text
Public Function OfVector ( _
	vector As Double _
) As Double
```

Visual C++
---
```text
public:
double OfVector(
	double vector
)
```

# ### Parameters
vector
    Type: System..::..Double The vector to transform.
# ### Return Value
The transformed vector.
# Remarks
Transformation of a vector is not affected by the translational part of the transformation.
# See Also
Transform1D Class
Autodesk.Revit.DB Namespace